<?php
$score=0;//Δημιουργείται μια μεταβλητή όπου αργότερα θα μετράει το σκορ των σωστών απαντήσεων
$i=0;//Χρησιμοποίησα αυτή την μεταβλητή ως δείκτη για να ελέγξω κάθε στοιχείο του πίνακα
$q1=$_POST['q1'];//Παίρνει την απάντηση του χρήστη για την ερώτηση q1 και την αποθηκεύει στη μεταβλητή q1
$q2=$_POST['q2'];//Παίρνει την απάντηση του χρήστη για την ερώτηση q2 και την αποθηκεύει στη μεταβλητή q2
$q3=$_POST['q3'];//Παίρνει την απάντηση του χρήστη για την ερώτηση q3 και την αποθηκεύει στη μεταβλητή q3
$q4=$_POST['q4'];//Παίρνει την απάντηση του χρήστη για την ερώτηση q4 και την αποθηκεύει στη μεταβλητή q4
$q5=$_POST['q5'];//Παίρνει την απάντηση του χρήστη για την ερώτηση q5 και την αποθηκεύει στη μεταβλητή q5
$q6=$_POST['q6'];//Παίρνει την απάντηση του χρήστη για την ερώτηση q6 και την αποθηκεύει στη μεταβλητή q6
$q7=$_POST['q7'];//Παίρνει την απάντηση του χρήστη για την ερώτηση q7 και την αποθηκεύει στη μεταβλητή q7
$q8=$_POST['q8'];//Παίρνει την απάντηση του χρήστη για την ερώτηση q8 και την αποθηκεύει στη μεταβλητή q8
$q9=$_POST['q9'];//Παίρνει την απάντηση του χρήστη για την ερώτηση q9 και την αποθηκεύει στη μεταβλητή q9
$q10=$_POST['q10'];//Παίρνει την απάντηση του χρήστη για την ερώτηση q10 κα την αποθηκεύει στη μεταβλητή q10
$answers=[$q1,$q2,$q3,$q4,$q5, $q6, $q7,$q8,$q9,$q10];//Έβαλα όλες τις απαντήσεις (answers)σε ένα πίνακα
$correct=['Α','Β','Β','Β','Β','Β','Β','Α','Α','Β'];//Έβαλα όλες τις σωστές απαντήσεις (correct)σε ένα πίνακα
foreach($answers as $answer) {//Το foreach είναι για το πέρασμα ένα-ένα των στοιχείων του πίνακα
	if ($answer==$correct[$i]) {//Σε αυτό το σημείο θα γίνει έλεγχος αν η απάντηση που έδωσε ο χρήστης είναι σωστή ή όχι
		$score++;//Εάν η απάντηση είναι σωστή, τότε το σκορ θα αυξηθεί κατά 1
	}
	$i++;//Είναι απαραίτητο να μπει ο δείκτης σε αυτό το σημείο, προκειμένου μόλις γίνει ο έλεγχος της μιας ερώτησης, να 'τρέξει' ξανά το πρόγραμμα και για τις επόμενες ερωτήσεις
}
echo "Έχεις   ", $score,"/10 σωστές απαντήσεις!";// Σε αυτό το σημείο εκτυπώνεται το τελικό αποτέλεσμα των σωστών απαντήσεων
echo "   To σκορ σου είναι  ", ($score*10), "%."; //Το πολλαπλασίασα επί 10 γιατί 10 είναι οι ερωτήσεις

if ($score>=5) {//Σε αυτό το σημείο ελέγχω τον αριθμό των σωστών απαντήσεων
	echo "   Συγχαρητήρια! Πέτυχες στο τεστ. Αγαπάς πραγματικά την ανάγνωση βιβλίων!";//Εάν ο χρήστης είχε τουλάχιστον πέντε σωστές απαντήσεις εκτυπώνει το εξής μήνυμα
} else {
	echo "   Λυπάμαι. Δεν πέτυχες στο τεστ. Προσπάθησε να διαβάζεις περισσότερο!";//Εάν ο χρήστης είχε λιγότερο από πέντε σωστές απαντήσεις, εκτυπώνει το εξής μήνυμα
}