-- Δημιουργώ την βάση για τα άρθρα του pet shop

CREATE DATABASE paw_corner; -- δημιουργώ μία βάση για το pet-shop paw corner

-- Δημιουργώ τον πίνακα των άρθρων
CREATE TABLE articles ( 
    id INT PRIMARY KEY AUTO_INCREMENT, -- Το id είναι σαν "αριθμός ταυτότητας" κάθε άρθρου δίχως αυτό, δεν θα μπορώ να διαγράφω κάποιο συγκεκριμένο άρθρο ή να προσθέτω/αφαιρώ στοιχεία. Με το auto_increment αυξάνεται μόνο του το id
    title VARCHAR(200), -- σε αυτό μπαίνει ο τίτλος του κειμένου μέχρι 200 χαρακτήρες
    image VARCHAR(255), -- εδώ είναι ο χώρος της εικόνας που θα πρέπει να έχει έως 255 χαρακτήρες
    content TEXT,
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP-- με αυτή τη εντολή αποθηκεύει πότε δημιουργήθηκε το άρθρο, το TIMESTAMP αποθηκεύει την ημερομηνία και την ώρα και με το CURRENT TIMESTAMP μπαίνει αυτόματα η ημερομηνία και η ώρα
    );
    
-- Θα προσθέσω τα άρθρα στον πίνακα
INSERT INTO articles (title, image, content)
VALUES
(
'Πρώτη Μέρα στο Σπίτι με το Κουτάβι σας',
'koutavi.jpg',
'Ετοιμάστε έναν ήσυχο, ζεστό χώρο όπου θα νιώθει ασφάλεια.
Δώστε του χρόνο να εξερευνήσει το σπίτι χωρίς πίεση.
Φροντίστε να έχει πάντα φρέσκο νερό και το γεύμα που έχει συνηθίσει.
Περιορίστε την πρόσβαση σε επικίνδυνα σημεία (σκάλες, καλώδια κ.λπ.).
Κρατήστε ήρεμη στάση και μιλήστε του με γλυκό τόνο για να χτίσετε εμπιστοσύνη.
Ξεκινήστε από την πρώτη μέρα μια απλή ρουτίνα (φαγητό, βόλτα, ύπνος).'
),

(
'Tips Φροντίδας νεογέννητων γατιών',
'gataki.jpg',
'Διατηρήστε τα ζεστά γιατί τα νεογέννητα δεν μπορούν να ρυθμίσουν τη θερμοκρασία τους.
Αν δεν υπάρχει μητέρα, χρησιμοποιήστε ειδικό γάλα για γατάκια (όχι αγελαδινό).
Ταΐζετε μικρές ποσότητες συχνά, σύμφωνα με την ηλικία τους.
Βοηθήστε τα με απαλό καθάρισμα μετά το τάισμα για την υγιεινή τους.
Συμβουλευτείτε κτηνίατρο για έλεγχο και σωστή καθοδήγηση από τις πρώτες ημέρες.
Δημιουργήστε μια ήσυχη, καθαρή και προστατευμένη φωλίτσα, μακριά από ρεύματα αέρα.
Ζυγίζετε τα καθημερινά για να βεβαιωθείτε ότι παίρνουν σταθερά βάρος.
Χειριστείτε τα απαλά και μόνο όταν είναι απαραίτητο τις πρώτες ημέρες.
Παρατηρείτε για σημάδια αδυναμίας, συνεχές κλάμα ή μειωμένη όρεξη.
Φροντίστε η μητέρα (αν υπάρχει) να έχει ποιοτική τροφή και ήρεμο περιβάλλον.'
),

(
'Νέο κατοικίδιο στο σπίτι: Όλα όσα πρέπει να γνωρίζεις',
'koytavaki.jpg',
'Η άφιξη ενός νέου κατοικιδίου στο σπίτι είναι η αρχή μίας νέας σχέσης, γεμάτης ευθύνη, τρυφερότητα και πολλές μικρές καθημερινές στιγμές που θα γίνουν συνήθεια. Ετοιμάζεσαι να υποδεχτείς το μικρό σου φιλαράκι στο σπίτι; Είτε πρόκειται για κουτάβι, είτε για γατάκι, η σωστή προετοιμασία θα κάνει τη μετάβαση πιο ομαλή και για σένα και για εκείνο.

Η πρώτη μέρα: Τι χρειάζεται ένα νέο κατοικίδιο
Πριν ακόμα ανοίξεις την πόρτα του σπιτιού σου για το κατοικίδιο, καλό είναι να έχεις ήδη προμηθευτεί τα βασικά:
Κατάλληλη τροφή, μπολ για φαγητό και νερό, κρεβάτι, λουρί, άμμο για γάτες, παιχνίδια και τσάντα μεταφοράς.

Πώς θα προσαρμοστεί πιο εύκολα
Δώσε χρόνο, σταθερότητα και ηρεμία. Μην το πιέζεις, άφησέ το να σε εμπιστευτεί σταδιακά.'
);

select * from articles
Order by created_at DESC;

ALTER TABLE articles -- Mε αυτή την εντολή αλλάζω τον πίνακα articles και προσθέτω τη στήλη content 
ADD content TEXT;

SHOW DATABASES;
USE paw_corner;
DESCRIBE articles;
SELECT * FROM articles;

SELECT id, title, content FROM articles;