<?php
$enosi = new mysqli("localhost", "root", "admin", "paw_corner");/*  H $enosi είναι μία μεταβλητή όπου θα κρατήσει τη
 "σύνδεση" με τη βάση δεδομένων. Το 'localhost' είναι το πού βρίσκεται η βάση, το "root" είναι το username της βάσης, το "" 
 είναι ο κωδικός πρόσβασης και σημαίνει πως δεν υπάρχει password και το paw_corner είναι το όνομα της βάσης */

if ($enosi->connect_error) {  /* Το -> λέγεται "τελεστής αντικειμένου" και χρησιμοποιείται για να "μπεις" μέσα σε ένα αντικείμενο 
 και να πάρεις ιδιότητες και μεθόδους. To αντικείμενο είναι η μεταβλητή $enosi και το connect_error είναι η ιδιότητα */
    die("DB ERROR: " . $enosi->connect_error);
}

echo "DB OK ✔";
?>


