function startQuiz () {
let score=0;
let answer1=prompt("Η θετική ενίσχυση βοηθά τον σκύλο να μαθαίνει πιο γρήγορα. (Σωστό/Λάθος)");
if (answer1==="Σωστό") score++;
let answer2=prompt("Η εκπαίδευση είναι απαραίτητη μόνο όταν ο σκύλος είναι επιθετικός. (Σωστό/Λάθος)");
if (answer2==="Λάθος") score++;
let answer3=prompt("Τα κουτάβια μπορούν να ξεκινήσουν βασική εκπαίδευση από την ηλικία των 2 μηνών. (Σωστό/Λάθος)");
if (answer3==="Σωστό") score++;
let answer4=prompt("Οι μεγάλες σε διάρκεια συνεδρίες εκπαίδευσης (πάνω απο 1 ώρα) είναι κατάλληλες για κουτάβια. (Σωστό/Λάθος)");
if (answer4==="Λάθος") score++;
let answer5= prompt("Η εντολή 'Έλα' είναι σημαντική για την ασφάλεια του σκύλου. (Σωστό/Λάθος)");
if (answer5==="Σωστό") score++;
alert ("Ολοκληρώσατε το quiz! Σκορ: " + score + "/5");
}
