function StartQuiz1 () {
let score=0;
let answer1=prompt("Οι σκύλοι έχουν καλύτερη όσφρηση από τους ανθρώπους.(Σωστό/Λάθος)");
if (answer1==="Σωστό") score++;
let answer2=prompt("Οι σκύλοι βλέπουν μόνο ασπρόμαυρα. (Σωστό/Λάθος)");
if (answer2==="Λάθος") score++;
let answer3=prompt("Η σοκολάτα είναι ασφαλής για τους σκύλους σε μικρές ποσότητες. (Σωστό/Λάθος)");
if (answer3==="Λάθος") score++;
let answer4=prompt("Οι σκύλοι δεν μπορούν να καταλάβουν τη διάθεση του ιδιοκτήτη τους. (Σωστό/Λάθος)");
if (answer4==="Λάθος") score++;
let answer5=prompt("Όλοι οι σκύλοι κολυμπούν από τη φύση τους. (Σωστό/Λάθος)");
if(answer5==="Λάθος") score++;
alert ("Ολοκληρώσατε το quiz! Σκορ: " + score + "/5");
}

