function StartQuiz3 (){
	let score=0;
	let answer1=prompt("Οι γάτες μπορούν να δουν πολύ καλά στο σκοτάδι. (Σωστό/Λάθος)");
	if(answer1==="Σωστό") score++;
	let answer2=prompt("Οι γάτες δεν χρειάζονται καθόλου νερό γιατί παίρνουν υγρά μόνο από την τροφή τους. (Σωστό/Λάθος)");
	if (answer2==="Λάθος") score++;
	let answer3=prompt ("Οι γάτες δεν χρησιμοποιούν τα μουστάκια τους για να καταλαβαίνουν τον χώρο γύρω τους. (Σωστό/Λάθος)");
	if (answer3==="Λάθος") score++;
	let answer4=prompt ("Όλες οι γάτες αγαπούν το μπάνιο με νερό. (Σωστό/Λάθος)");
	if(answer4==="Λάθος") score++;
	let answer5=prompt("Οι γάτες μπορούν να πέσουν από ύψος και συχνά να προσγειωθούν στα πόδια τους. (Σωστό/Λάθος)");
	if(answer5==="Σωστό") score++;
	alert ("Ολοκλήρωσες το quiz! Σκορ: " + score + "/5");
}
	
	
	
	
	
	
