<?php
$score=0; //Θα δημιουργηθεί μία μεταβλητή όπου αργότερα θα μετράει το σκορ των σωστών απαντήσεων
$i=0; //Χρησιμοποίησα αυτή τη μεταβλητή ως δείκτη για να ελέγξω κάθε στοιχείο του πίνακα
$q1=$_POST['q1']; // Παίρνει την απάντηση του χρήστη για την ερώτηση q1 και την αποθηκεύει στη μεταβλητή q1
$q2=$_POST['q2'];
$q3=$_POST['q3'];
$q4=$_POST['q4'];
$q5=$_POST['q5'];
$q6=$_POST['q6'];
$q7=$_POST['q7'];
$q8=$_POST['q8'];
$answers=[$q1, $q2,$q3,$q4,$q5,$q6,$q7,$q8]; //Έβαλα όλες τις απαντήσεις σε έναν πίνακα
$correct=['Γ','Β','Γ','Β','Δ','Α','Β','Α'];//Έβαλα όλες τις σωστές απαντήσεις σε έναν πίνακα
foreach($answers as $answer) { //ΤΟ foreach είναι για το πέρασμα ένα-ένα των στοιχείων του πίνακα
if ($answer==$correct[$i]) { // Σε αυτο το σημείο θα γίνει έλεγχος αν η απάντηση που έδωσε ο χρήστης είναι σωστή ή όχι
$score++; //Εάν η απάντηση είναι σωστή, τότε το σκορ θα αυξηθεί κατά 1
}
$i++;// Είναι απαραίτητο να μπει ο δείκτης σε αυτό το σημείο, προκειμένου μόλις γίνειο έλεγχος της μίας ερώτησης, να "τρέξει" ξανά το πρόγραμμα και για τις επόμενες ερωτήσεις
}

$pososto = ($score/8)*100;

echo "Έχεις ", $score, "/8 σωστές απαντήσεις!"; // Σε αυτό το σημείο θα εκτυπωθεί το τελικό αποτέλεσμα των σωστών απαντήσεων
echo "  Το σκορ σου είναι ", $pososto, "%"; // Το πολλαπλασίασα επί 8 γιατί είναι 8 οι ερωτήσεις

if ($score>=4) {// Σε αυτό το σημείο ελέγχω τον αριθμό των σωστών απαντήσεων
echo " Μπράβο! Είσαι πραγματικός συλλέκτης Funko Pop! "; 
} else { 
echo " Χμ, γιατί βρίσκεσαι εδώ; Μήπως έχασες τον δρόμο σου; Δεν έχεις ιδέα τι είναι τα Funko Pop!";
}
?>








