<?php
$score=0;
$q1=$_POST['q1'];
$q2=$_POST['q2'];
$q3=$_POST['q3'];
$q4=$_POST['q4'];
$q5=$_POST['q5'];
$q6=$_POST['q6'];
$q7=$_POST['q7'];

 if ($q1=="Κολοσσαίο"){
	 $score++;
 }
 if ($q2=="Κάπρι") {
	 $score++;
 }
 if ($q3=="Σπαγγέτι μπολονέζ") {
	 $score++;
 }
 if ($q4=="Πύργος της Πίζας") {
	 $score++;
 }
 if ($q5=="Βεζούβιος"){
	 $score++;
 }
 if ($q6=="Λεονάρντο Ντα Βίντσι, Μιχαήλ Άγγελος, Ραφαήλ") {
 $score++;
 }
 if ($q7=="Σικελία") {
	 $score++;
 }
 echo "Το σκορ σας είναι: ", "<br>", $score;
 ?>


